#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 0s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=Xp4djXNa1DRaZHmOwGg]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=b6e-w7p-ejMkXH8bbNg]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=3vBHQVL4pJXoSnLz1_U]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=bc896890-9bd4-11ef-aed6-617073747261]
null_resource.force_redeploy: Refreshing state... [id=1898315153026576473]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "24db4657-6e26-4cd2-bc9d-a932acc3f22d"
      + comment                 = "$COMMENT Terraform {{.TerraformVersion}}, provider {{.ProviderVersion}}"
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "1898315153026576473" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "30" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "24db4657-6e26-4cd2-bc9d-a932acc3f22d"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + name             = "BGP peering with VPN router"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + name                 = "IP handoff to VPN router"
      + primitive            = (known after apply)
      + routing_zone_id      = "4vFKWvrNxAQ9XvHtp4k"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor A Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "Xp4djXNa1DRaZHmOwGg"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor B Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "b6e-w7p-ejMkXH8bbNg"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor C Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "3vBHQVL4pJXoSnLz1_U"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_D"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor D Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template" "vpn" {
      ~ description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]" -> "includes routing policies for [Vendor_A, Vendor_B, Vendor_C, Vendor_D]"
        id           = "bc896890-9bd4-11ef-aed6-617073747261"
        name         = "IP+BGP handoff to VPN block"
      ~ primitives   = [
          - jsonencode(
                {
                  - data  = {
                      - child_primitives     = [
                          - jsonencode(
                                {
                                  - data  = {
                                      - bfd_enabled          = false
                                      - child_primitives     = [
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "b6e-w7p-ejMkXH8bbNg"
                                                    }
                                                  - label = "Vendor B Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "Xp4djXNa1DRaZHmOwGg"
                                                    }
                                                  - label = "Vendor A Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "3vBHQVL4pJXoSnLz1_U"
                                                    }
                                                  - label = "Vendor C Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                        ]
                                      - hold_time            = null
                                      - ipv4_address         = "192.168.5.5"
                                      - ipv4_afi_enabled     = true
                                      - ipv6_address         = null
                                      - ipv6_afi_enabled     = false
                                      - keepalive_time       = null
                                      - local_asn            = null
                                      - neighbor_asn         = null
                                      - neighbor_asn_dynaimc = true
                                      - password             = null
                                      - ttl                  = 0
                                    }
                                  - label = "BGP peering with VPN router"
                                  - type  = "AttachIpEndpointWithBgpNsxt"
                                }
                            ),
                        ]
                      - ipv4_addressing_type = "numbered"
                      - ipv6_addressing_type = "none"
                      - routing_zone_id      = "4vFKWvrNxAQ9XvHtp4k"
                      - tagged               = false
                    }
                  - label = "IP handoff to VPN router"
                  - type  = "AttachLogicalLink"
                }
            ),
          + (known after apply),
        ]
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "24db4657-6e26-4cd2-bc9d-a932acc3f22d"
      + description         = "Vendor_D: Import count: 1 Export count: 3"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.7.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.64.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.19.0.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_D"
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Warning: Blueprint has build errors

  with apstra_blueprint_deployment.dc_1,
  on main.tf line 14, in resource "apstra_blueprint_deployment" "dc_1":
  14: resource "apstra_blueprint_deployment" "dc_1" {

1 build errors must be resolved

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   